fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоровИРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать список документов реализации товаров и услуг.
// 
// Параметры:
//  ДатаНачалаПериода Дата начала периода
//  ДатаОкончанияПериода Дата окончания периода
// 
// Возвращаемое значение:
//  Структура - Создать список документов реализации товаров и услуг:
// * МассивДоговоровИРеализаций - Массив из Структура - 
// * ДокументовСоздано - Число - 
// * ДокументовНеСоздано - Число - 
Функция СоздатьСписокДокументовРеализацииТоваровИУслуг(Знач ДатаНачалаПериода, Знач ДатаОкончанияПериода) Экспорт
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ДоговорыКонтрагентов.Ссылка КАК Договор,
|	ДоговорыКонтрагентов.Владелец КАК Владелец,
|	ДоговорыКонтрагентов.Организация КАК Организация,
|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.Владелец) КАК КонтрагентПредставление,
|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДоговорыКонтрагентов.Ссылка) КАК ДоговорПредставление
|ПОМЕСТИТЬ ВТ_ДействующиеДоговора
|ИЗ
|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
|ГДЕ
|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &ДатаОкончанияПериода
|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &ДатаНачалаПериода
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	РеализацияТоваровУслуг.Ссылка КАК Документ
|ПОМЕСТИТЬ ВТ_СуществующиеДокументы
|ИЗ
|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
|ГДЕ
|	РеализацияТоваровУслуг.Проведен
|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода
|	И РеализацияТоваровУслуг.Договор В
|		(ВЫБРАТЬ
|			ВТ_ДействующиеДоговора.Договор КАК Договор
|		ИЗ
|			ВТ_ДействующиеДоговора КАК ВТ_ДействующиеДоговора)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_ДействующиеДоговора.Договор КАК Договор,
|	ЕСТЬNULL(ВТ_СуществующиеДокументы.Документ, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Документ,
|	&ДатаОкончанияПериода КАК Дата,
|	""Документ создан автоматически."" КАК Комментарий,
|	ВТ_ДействующиеДоговора.Владелец КАК Контрагент,
|	ВТ_ДействующиеДоговора.Организация КАК Организация,
|	ВТ_ДействующиеДоговора.ДоговорПредставление КАК ДоговорПредставление,
|	ВТ_ДействующиеДоговора.КонтрагентПредставление КАК КонтрагентПредставление
|ИЗ
|	ВТ_ДействующиеДоговора КАК ВТ_ДействующиеДоговора
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуществующиеДокументы КАК ВТ_СуществующиеДокументы
|		ПО ВТ_ДействующиеДоговора.Договор = ВТ_СуществующиеДокументы.Документ.Договор
|ГДЕ
|	ЕСТЬNULL(ВТ_СуществующиеДокументы.Документ,
|		ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)";

Запрос.УстановитьПараметр("ДатаНачалаПериода", ДатаНачалаПериода);
Запрос.УстановитьПараметр("ДатаОкончанияПериода", ДатаОкончанияПериода);


Выборка = Запрос.Выполнить().Выбрать();

ДокументовСоздано = 0;
ДокументовНеСоздано = 0;

СписокДоговоровИРеализаций = Новый ТаблицаЗначений;
СписокДоговоровИРеализаций.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
СписокДоговоровИРеализаций.Колонки.Добавить("Реализация", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));

Пока Выборка.Следующий() Цикл
	
	ЗаписьЖурналаРегистрации("ВКМ_МассовоеСозданиеАктов", УровеньЖурналаРегистрации.Информация,,,
		"Обработка договора: " + Выборка.ДоговорПредставление + ", контрагент: " + Выборка.КонтрагентПредставление);
	
	ДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	ДокументРеализации.Заполнить(Выборка);
	ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение();
	
	ЗаписьЖурналаРегистрации("ВКМ_МассовоеСозданиеАктов", УровеньЖурналаРегистрации.Информация,,,
		"Сумма документа после автозаполнения: " + ДокументРеализации.СуммаДокумента);
	
	Если ДокументРеализации.СуммаДокумента = 0 Тогда
		ТекстСообщения = СтрШаблон("Документ не создан: сумма равна 0 для %1 по договору %2",
			Выборка.КонтрагентПредставление, Выборка.ДоговорПредставление);
		ЗаписьЖурналаРегистрации("ВКМ_МассовоеСозданиеАктов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		Продолжить;
	КонецЕсли;
	
	Попытка
		
		РезультатПроверки = ДокументРеализации.ПроверитьЗаполнение();
		ЗаписьЖурналаРегистрации("ВКМ_МассовоеСозданиеАктов", УровеньЖурналаРегистрации.Информация,,,
			"Проверка заполнения: " + РезультатПроверки);
		
		Если РезультатПроверки Тогда
			ДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
			ДокументовСоздано = ДокументовСоздано + 1;
			Строка = СписокДоговоровИРеализаций.Добавить();
			Строка.Договор = Выборка.Договор;
			Строка.Реализация = ДокументРеализации.Ссылка;
		Иначе
			ТекстИсключения = СтрШаблон("Не прошел проверку заполнения документ для %1 по договору %2", Выборка.КонтрагентПредставление, Выборка.ДоговорПредставление);
			ЗаписьЖурналаРегистрации("ВКМ_МассовоеСозданиеАктов", УровеньЖурналаРегистрации.Ошибка,,, ТекстИсключения);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
	Исключение
		
		ДокументовНеСоздано = ДокументовНеСоздано + 1;
		
		ЗаписьЖурналаРегистрации("ВКМ_МассовоеСозданиеАктов", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	
	КонецПопытки;

КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("МассивДоговоровИРеализаций", ОбщегоНазначения.ТаблицаЗначенийВМассив(СписокДоговоровИРеализаций));
	Результат.Вставить("ДокументовСоздано",ДокументовСоздано);
	Результат.Вставить("ДокументовНеСоздано", ДокументовНеСоздано);
	
	Возврат Результат;
	
			
	
КонецФункции


#КонецОбласти

#КонецЕсли
